/*
 * =====================================================================================
 *
 *       Filename:  demo2.cpp
 *
 *    Description: алгоритм рабина-карпа
 *		в качестве хеша должен быть полиномиальный хэш
 *		точно не сравнивать строки, если хнши совпали считать чтол строки совпали
 *		работать в uint64_t
 *    2^31 - 1 
 *
 *        Version:  1.0
 *        Created:  10.10.2020 11:16:18
 *       Revision:  none
 *       Compiler:  gcc
 *
 *         Author:  YOUR NAME (), 
 *   Organization:  
 *
 * =====================================================================================
 */
#include <stdlib.h>

